In [36]:
import pandas as pd 
from sklearn.preprocessing import OneHotEncoder

In [37]:
df  = pd.read_csv('cars.csv')

In [38]:
df.head()

        brand  km_driven      fuel         owner  selling_price
0        Audi     248217       CNG   Third Owner        1459898
1      Jaguar     215862       CNG  Fourth Owner        2398921
2        Fiat      84557  Electric   First Owner        3312228
3  Volkswagen     247744  Electric  Second Owner        2671846
4       Skoda      76260       CNG  Second Owner        4284127

In [39]:
df['brand'].value_counts()

brand
Jeep          376
Lexus         374
Porsche       370
Isuzu         368
Volkswagen    361
Nissan        360
Citroen       357
Mercedes      344
Mitsubishi    343
Datsun        339
Fiat          339
Land Rover    338
Toyota        336
Honda         336
Kia           334
Hyundai       331
Volvo         328
Ford          325
Jaguar        323
Mini          322
Force         318
BMW           316
Mahindra      314
Maruti        313
MG            313
Renault       310
Skoda         308
Chevrolet     307
Tata          302
Audi          295
Name: count, dtype: int64

In [40]:
df['brand'].unique()

array(['Audi', 'Jaguar', 'Fiat', 'Volkswagen', 'Skoda', 'Mercedes',
       'Land Rover', 'Isuzu', 'Volvo', 'Lexus', 'Mini', 'Toyota', 'Honda',
       'Porsche', 'Hyundai', 'Kia', 'Datsun', 'BMW', 'Citroen', 'Maruti',
       'Mitsubishi', 'Jeep', 'Force', 'Mahindra', 'Renault', 'Ford',
       'Tata', 'MG', 'Chevrolet', 'Nissan'], dtype=object)

In [41]:
df.columns

Index(['brand', 'km_driven', 'fuel', 'owner', 'selling_price'], dtype='object')

In [42]:
df.fuel.unique()

array(['CNG', 'Electric', 'Diesel', 'Petrol'], dtype=object)

In [43]:
df.owner.unique()

array(['Third Owner', 'Fourth Owner', 'First Owner', 'Second Owner'],
      dtype=object)

In [44]:
## let su now firt deal with the fuel and use one hot encoding for that.

## first we will use the get_dummies function from pandas to do one hot encoding for the fuel column.

# pd.get_dummies(df['fuel'], dtype=int)

In [46]:
## as you can see in the output we have Four new columns for each unique value in the fuel column and we have 1 in the column that corresponds to the value in the fuel column and 0 in the other columns.

## Now to avoid multicollinearity we will drop one of the columns and we will drop the column that corresponds to the most frequent value in the fuel column which is petrol.

## this can be done as follows

pd.get_dummies(df, columns=['fuel', 'owner'], dtype=int, drop_first=True)

,brand,km_driven,selling_price,fuel_Diesel,fuel_Electric,fuel_Petrol,owner_Fourth Owner,owner_Second Owner,owner_Third Owner
0,Audi,248217,1459898,0,0,0,0,0,1
1,Jaguar,215862,2398921,0,0,0,1,0,0
2,Fiat,84557,3312228,0,1,0,0,0,0
3,Volkswagen,247744,2671846,0,1,0,0,1,0
4,Skoda,76260,4284127,0,0,0,0,1,0
...,...,...,...,...,...,...,...,...,...
9995,Mitsubishi,138318,3500432,0,0,1,0,0,1
9996,Citroen,25010,1048716,0,0,1,0,0,1
9997,Ford,131951,2183761,0,0,1,1,0,0
9998,Mini,73358,244512,0,1,0,1,0,0
9999,Land Rover,226275,2849493,0,0,0,0,0,0

In [49]:
df.head()

        brand  km_driven      fuel         owner  selling_price
0        Audi     248217       CNG   Third Owner        1459898
1      Jaguar     215862       CNG  Fourth Owner        2398921
2        Fiat      84557  Electric   First Owner        3312228
3  Volkswagen     247744  Electric  Second Owner        2671846
4       Skoda      76260       CNG  Second Owner        4284127

In [50]:
## now we will do the same using the fuel column using the sklearn library # first we have split the data in to x_train x_test and Y_train y_test 

from sklearn.model_selection import train_test_split

x_train,x_test,y_train,y_test = train_test_split(df.drop('selling_price',axis =1),df.selling_price, test_size = 0.2,random_state =42)

In [55]:
## Now we will create the object of ONEHOTENCCODER 

ohe = OneHotEncoder(drop = 'first')

x_train_new = ohe.fit_transform(x_train[['fuel','owner']])
x_test_new = ohe.transform(x_test[['fuel','owner']])

print(x_train_new.shape)
print(x_test_new.shape)
print(x_train.head())

(8000, 6)
(2000, 6)
        brand  km_driven      fuel         owner
9254  Citroen     160470    Petrol  Fourth Owner
1561     Mini      29596  Electric  Fourth Owner
1670  Renault      43192    Diesel  Fourth Owner
6087  Hyundai      75966  Electric   First Owner
6669    Lexus     144192    Petrol  Fourth Owner

In [54]:
import numpy as np

In [ ]:
df_new= pd.DataFrame(np.hstack((x_train[['brand','km_driven']].values, x_train_new.toarray())),index=x_train.index, columns=['brand','km_driven']+list(ohe.get_feature_names_out()))


## this above is how we can do one hot encoding using the sklearn library and we have to convert the sparse matrix to a dense matrix using the toarray() method and then we have to concatenate it with the original dataframe using the hstack() method from numpy and then we have to create a new dataframe from the concatenated array and we have to set the index and columns of the new dataframe.

## in simple terms the above code is doing the same thing as the get_dummies function from pandas but we have to do it manually using the OneHotEncoder class from sklearn and we have to convert the sparse matrix to a dense matrix and then we have to concatenate it with the original dataframe and then we have to create a new dataframe from the concatenated array and we have to set the index and columns of the new dataframe.

In [71]:
df_new.sample(5)

,brand,km_driven,fuel_Diesel,fuel_Electric,fuel_Petrol,owner_Fourth Owner,owner_Second Owner,owner_Third Owner
4555,Skoda,71062,0.0,0.0,1.0,1.0,0.0,0.0
7576,Volvo,59607,0.0,0.0,0.0,1.0,0.0,0.0
2671,Chevrolet,220432,1.0,0.0,0.0,0.0,0.0,0.0
3525,Skoda,92238,1.0,0.0,0.0,0.0,0.0,1.0
3147,BMW,197070,0.0,0.0,0.0,0.0,0.0,1.0

In [ ]:
## Also the one hot encoding has a special property that can be use to somewhat creatae a threshold for categorical variabls and only create columns for those whoa re above the the threshold and for the others it just create a common column for them and this can be done using the OneHotEncoder class from sklearn by setting the parameter max_categories to the desired threshold and then it will create columns for those categories that are above the threshold and for the others it will create a common column for them and this can be useful when we have a large number of categories in a categorical variable and we want to reduce the number of columns created by one hot encoding.

ohe= OneHotEncoder(min_frequency=100, drop = 'first') ## this create only the rows for value that have frequency more that 100 and for the others it will create a common column for them.